

* babel
#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((restclient . t)))
#+end_src

#+RESULTS:

* lsp

#+begin_src emacs-lisp :tangle no
(use-package lsp-mode
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  :init (setq lsp-keymap-prefix "<f12>")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)
         ;; if you want which-key integration
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

(setq read-process-output-max (* 1024 1024))


#+end_src

#+RESULTS:
: 1048576
